app/controllers/posts_controller.rb

def index
    # @post = Post.all
    @author = Author.find(1)
    @posts = Post.page(params[:page]).per(10)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "body", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "これはテストです"], ["body", "なんとか簡易ブログがポストできそう"], ["category", "テスト"], ["created_at", "2016-02-20 04:26:19.591545"], ["updated_at", "2016-02-20 04:26:19.591545"]]

def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "記事4"], ["body", "記事4の本文"], ["updated_at", "2016-02-20 04:38:46.460449"], ["id", 4]]